# Working with dataframes !

## Create an empy dataframe

In [3]:
## Insert your code here
import pandas as pd 
df = pd.DataFrame()

## Load file from 
1. Download csv from https://data.fivethirtyeight.com/ : Dear Mona Followup: Where Do People Drink The Most Beer, Wine And Spirits?
2. Load the file into a csv

In [6]:
## Insert your code here
df = pd.read_csv("drinks.csv")

## Show the columns of the dataframe

In [13]:
## Insert your code here
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

## Show the first columns of the dataframe

In [7]:
## Insert your code here
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

## Show the values for country column

In [10]:
## Insert your code here
df['country']

0      Afghanistan
1          Albania
2          Algeria
3          Andorra
4           Angola
          ...
188      Venezuela
189        Vietnam
190          Yemen
191         Zambia
192       Zimbabwe
Name: country, Length: 193, dtype: object

## Show the values for country and total_litres_of_pure_alcohol

In [11]:
## Insert your code here
df[['country','total_litres_of_pure_alcohol']]

         country  total_litres_of_pure_alcohol
0    Afghanistan                           0.0
1        Albania                           4.9
2        Algeria                           0.7
3        Andorra                          12.4
4         Angola                           5.9
..           ...                           ...
188    Venezuela                           7.7
189      Vietnam                           2.0
190        Yemen                           0.1
191       Zambia                           2.5
192     Zimbabwe                           4.7

[193 rows x 2 columns]

## Find the value of total_litres_of_pure_alcohol for Uruguay

In [12]:
## Insert your code here
df[df['country']=='Uruguay']['total_litres_of_pure_alcohol']

185    6.6
Name: total_litres_of_pure_alcohol, dtype: float64

## What is the maximum value of beer_servings

In [22]:
## Insert your code here
df['beer_servings'].max()

376

## Which country has more beer consumption?

In [20]:
## Insert your code here
df.loc[df['beer_servings'].idxmax(axis = 0)]

country                         Namibia
beer_servings                       376
spirit_servings                       3
wine_servings                         1
total_litres_of_pure_alcohol        6.8
Name: 117, dtype: object

## What are the 5 countries with more beer consumption?

In [27]:
## Insert your code here
df.sort_values(by='beer_servings', ascending=False).head(5)['country']

117           Namibia
45     Czech Republic
62              Gabon
65            Germany
98          Lithuania
Name: country, dtype: object

## Calculate the total servings (the sum of beer, spirit and wine) for each country, adding a new column to the dataframe

In [32]:
## Insert your code here
df['total_servings'] = df['beer_servings'] + df['spirit_servings'] + df['wine_servings']

## Get the mean of the beer consumption

In [34]:
## Insert your code here
df['beer_servings'].mean()

106.16062176165804

## Delete the column total_litres_of_pure_alcohol

In [35]:
## Insert your code here
df.drop('total_litres_of_pure_alcohol', axis=1, inplace=True)